/*
 * mb_base.h
 *
 *  Created on: 24 лип. 2019 р.
 *      Author: KozakVF
 */

#ifndef MB_MONITOR_MB_BASE_H_
#define MB_MONITOR_MB_BASE_H_
#include "stdint.h"
#include "windows.h"
#include <commctrl.h>

/***************************************************************************************************************
 * 1. Повідомлення Модбас, що виявлені в мережі групуються за адресами.
 * 2. На кожну групу повідомлень заводиться структура/хендлер passport
 * 3. В хендлері зберігається стек з чотирьох останніх повідомлень та часу їх фіксації.
 * ****************
 * Якщо в хендлері за однією і тією ж адресою
 * в повідомленнях однієї і тієї ж довжини
 * з однаковим кодом команди Модбас
 * є неоднакові байти - вони помічаються.
 *
 * *************************************************************************************************************/
typedef struct{
	uint8_t last_msg[256];
	uint8_t n_msg;
	SYSTEMTIME last_activity_time;
}msg_info_t;


typedef struct {
	uint8_t address;
	uint32_t intensity;
	msg_info_t MSG[4];
}mb_passport_t;
extern mb_passport_t mb_passport[256];
extern uint8_t iMBP;
extern uint32_t msg_count;
extern uint8_t nBase;
int16_t f_passportInit();
int16_t f_add_to_BASE(uint8_t addr, uint8_t line[]);

void check_coincidental_psp(int psp_index);
/*
1) Виявити у паспорті нульві записи - не друкувати..
2) Якщо хоча б два ненульових..
   для першого з кожним наступним до останнього..
   якщо записи співпадає з кожним наступним по довжині, і коду команди
   якщо певний байт співпадає з якимось наступним -

   не так.
   якщо не одне повідомлення..
   якщо нульве співпадає з якимось наступним по довжині команді
   якщо при цьому їх байти не співпадають..

*/

#endif /* MB_MONITOR_MB_BASE_H_ */
