/*
 * a00_tk2Config.h
 *
 *  Created on: 9 січ. 2020 р.
 *      Author: KozakVF
 */

#ifndef SRC_MB_WINDOWS_TK2_A00_TK2CONFIG_H_
#define SRC_MB_WINDOWS_TK2_A00_TK2CONFIG_H_

/************************************************************************************************************
 *  ТЕКСТ МОДУЛІВ на С ДЛЯ ДИСТАНЦІЙНОГО УПРАВЛІННЯ PC_DESK <-> TK2
 * ** ********************************************************************************************************
 *  Файл                    Призначення
 *  ----------------------------------------------------------------------------------------------------------
 *  Папка mb_windows/tk2:
 *  a20_tk2.c/h				Основне вікно - управління ЕД та зчитування параметрів
 *  a21_tk2us.c/h			Друге вікно   - налаштування користувача
 *  a22_tk2fs.c/h           Третє вікно   - налаштування виробника
 *  a3_tk2TxRx.c/h  		Черга повідомлень і її обробка: передача на Модбас, попередня обробка відповіді
 *  a3_tk2z.c/h             Всякі функції, що є спільним для трьох вікон
 *  a4_tk2log./h			Ведення логів. Запис логів у файл, щодня - новий файл.
 *  a5_tk2levels.c/h        Робота з рівнями та процес-баром заповнення резервуару
 *
 *  Папка mb_windows
 *  a2_setting.c/h          Вікно налаштування СОМ-порту
 *  e1_passwordEdit.c/h     Вікно вводу пароля, цимус в зірочках, якими забиваються букви
 *  tkIconBitMask.c         Іконка логотипу Техноконт
 *
 *  Функції бібліотечні
 *  Папка b_funcs
 *  vk_log.c/h              Змінні і функції роботи з логами, повне ім'я файла в папці, де exeшник, щодня новий файл
 *  vk_wqueue.c/h           Робота з чергою, по-барабану, що ставити в чергу(це -цимус :))
 *  tw_mb.c/h               Сесія Модбас для сом-порта, використовується позичене (папка RS232),
 *                          Крута моя функція - не чекати таймаут, якщо відповіді є, а ловити на льоту по кусочку
 *                          40мс замість 1000мс таймауту
 *  tkCRC.c/h               CRC
 *
 *  Функції допоміжні
 *  hexdec.c/h              Зчитування чисел-рядків з Едіт-бокса і перетворення в цифру
 */

/*******************************************************************************************************************
 * КОРИСТУВАЦЬКІ ПОВІДОМЛЕННЯ WINDOWS
 * ****************************************************************************************************************
 * Реалізовано два типи користувацьких повідомлень Windows:
 *
 * VK_PSW                  (0xC001), файл "e1_passwordEdit.c/h"
 * У вікні що викликається користувач може ввести пароль, символи якого забиваються зірочками
							0
LRESULT SendMessage(
  HWND   hWnd,              - вікно, з якого був запит на ввод пароля і куди надсилається повідомлення
  UINT   Msg,				- VK_PSW, ідентифікатор повідомлення, введений мною
  WPARAM wParam,            - значення паролю, це поки-що число 0х0000..0хFFFF в десятичному форматі
  LPARAM lParam				- не використовується
);

Очевидно, що ловити повідомлення в вікні, яке викликає в
сase VK_PSW:
break;
 * ***************************************************************************************************************
  * VK_UPDATE_WINDOW                  (0xC002), файл "a3_tk2TxRx.c/h"
 *  Сесія Модбас, куди в чергу кидаються повідомлення, повертає повідомлення про завершення сесії,
 *  щод нагадати, що час обновити значення параметрів за результатами сесії Модбас
							0
LRESULT SendMessage(
  HWND   hWnd,              - вікно, з якого був запит на сесію Модбас і куди надсилається повідомлення
  UINT   Msg,				- VK_UPDATE_WINDOW, ідентифікатор повідомлення, введений мною
  WPARAM wParam,            - ідентифікатор типу Модбас повідомлення, який надсилався в чергу разом з повідомленням
  LPARAM lParam				- не використовується
);

Очевидно, що ловити повідомлення в вікні, яке викликає в
сase VK_UPDATE_WINDOW:
break;

 */


/* Період опитування змін у вікні */
/* ПЕРІОДИ ОСНОВНИХ ТАЙМЕРІВ */
#define TIMER_MAIN_MS                   50  /* IDT_TIMER_TK2_10MS  */
#define TIMER_AUX_MS                    3000/* IDT_TIMER_TK2_1333MS */


//#define TIMER_PERIOD_TK2_10_MS     10
/* Період відправки постійних періодичних запитів параметрів
 * 5 запитів = TIMER_PERIOD_TK2_1000_MS х 5         */
#define TIMER_PERIOD_TK2_1000_MS   1000
//#define TIMER_PERIOD_TK2_1333_MS   1333



#endif /* SRC_MB_WINDOWS_TK2_A00_TK2CONFIG_H_ */
