/* a2_TK112fs1.h
 *
 *  Created on: 25 вер. 2019 р.
 *      Author: KozakVF
 */


#ifndef MB_WINDOWS_TK4FS1
#define MB_WINDOWS_TK4FS1


#include "stdint.h"
#include "../../mb_devs/tk4_dist.h"
#include "a21_tk2us.h"
#include "a00_tk2Config.h"




//ПОСТІЙНА ЧАСУ НАГРІВАННЯ 														0Х0209	0Х1004	90
#define ID_EDIT_HEATINGTIMECONSTANT						150
//ГРАНИЧНА КІЛЬКІСТЬ ПУСКІВ ЕД ПРОТЯГОМ 10ХВ									0X0216	0X1014   5
#define ID_CMB_NUMBERSTARTLIMIT						    175

//ЗАТРИМКА ПУСКУ ЕД ПО РІВНЮ													0Х0214	0Х1006   4..
#define ID_EDIT_ONSENSORMOTORDELAY					    225
//ЗАТРИМКА ЗУПИНКИ ЕД ПО РІВНЮ													0Х0215	0Х1007   12
#define ID_EDIT_OFFSENSORMOTORDELAY						250
//ЗАТРИМКА ВІДНОВЛЕННЯ РОБОТИ ДАТЧИКА «СУХОГО ХОДУ» ПІСЛЯ АВАРІЇ «СУХОГО ХОДУ»	0Х0217	0Х1012   13
#define ID_EDIT_AFTRERDRYMOVEDELAY						275

//ВИБІР КОНТР ОПОРУ ІЗОЛЯЦІЇ/ПЛ.ПУСК                             ARR[26]		0X0219	0X101A	 0/1?
#define ID_CMB_INSUL_SOFTSTART_OPTION					325
//УСТАВКА ДЛЯ КОНТРОЛЯ ИЗОЛЯЦИИ ДВИГАТЕЛЯ
//ПРИ ОТСУТСТВИИ ПЛАВНОГО ПУСКА  											    0X020D	0Х1015   381
#define ID_EDIT_INSUL_WITHOUTSOFTSTART					350
//УСТАВКА ПОРОГА СРАБАТЫВАНИЯ ДАТЧИКА УРОВНЯ  					arr21		    0Х0213	0Х1016   1001
#define ID_EDIT_LEVELSENSORLIMIT						425
//УСТАВКА ДЛЯ ЗАПУСКА ДВИГАТЕЛЯ С ПЛАВНЫМ ПУСКОМ                arr[28]         0x021A  0x101C    700 код АЦП
#define ID_EDIT_SOFTSTART_PRM							450

//ТИПОРОЗМІР СТАНЦІЇ															0X0208	0Х1008    3
#define ID_CMB_TYPOROZMIR								475
//ФАЗНІСТЬ																		0Х020А	0X101E    3
#define ID_CMB_PHASNOST								    500
/*****************************************************************************************************************
 *
 *
 *
 */
/*******************************************************************************************************************
 *  Кнопки у вікні заводських налаштувань
 * *****************************************************************************************************************
 */
/* Кнопка вводу пароля                  */
#define ID_BTN_WRITE_PSW_FStk2         					1000
/* Кнопка читати заводські налаштування */
#define ID_BTN_READ_FStk2                               1001
/* Кнопка писати заводські налаштування */
#define ID_BTN_WRITE_FStk2                              1002
/* Кнопка виходу з вікна заводських налаштувань */
#define ID_BTN_EXIT_FStk2                               1003
/* Пункт меню виходу з вікна справа зверху*/
#define IDM_QUIT_FStk2                                  1009


/*******************************************************************************************************************
 * Таймери у вікні заводських налаштувань
 * *****************************************************************************************************************
 */
#define IDT_TIMER_FSTK2_1000MS                          1010
#define IDT_fsTIMER_TK2_10MS  						    1011


/*******************************************************************************************************************
 * Оголошення функцій
 * *****************************************************************************************************************
 */
LRESULT CALLBACK WndProcTk2fs(HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam);

LPCSTR f_RegisterTk2fsWndClass(HINSTANCE hinst);
HWND f_CreateTk2fsWnd(HWND hh1);
BOOL f_tk2fsUpdateWindow(HWND hwnd);





#endif /* MB_WINDOWS_A2_TX_MSG_C_ */
