/*
 * a5_tk2levels.h
 *
 *  Created on: 7 січ. 2020 р.
 *      Author: KozakVF
 */

#ifndef SRC_MB_WINDOWS_TK2_A5_TK2LEVELS_H_
#define SRC_MB_WINDOWS_TK2_A5_TK2LEVELS_H_
#include "stdint.h"


/* Цей тип змінної позначає стан процесу роботи насоса.
 * Напр. на подачу рідини ми маємо такі варіанти:
 * обидва датчики сухі  - нижній рівень,
 * обидва датчики мокрі - верхній рівень,
 * нижній датчик мокрий, верхній сухий:
 * а) насос працює і подає рідину
 * б) насос не працює, рівень рідини спадає по мірі споживання
 */
typedef enum{
	//обидва датчики мокрі - верхній рівень,
	HighLevel = 0x22,
	//нижній датчик мокрий, верхній сухий
	//а) насос працює і подає рідину
	LowToHigh = 0x02,
	//нижній датчик мокрий, верхній сухий:
	//насос не працює, рівень рідини спадає по мірі споживання
	HighToLow = 0x20,
	//обидва датчики сухі  - нижній рівень,
	LowLevel  = 0x11,
	/* нижній сухий, верхній мокрий - помилка */
	level_sensor_error = 0xFF,
	/*рівень невідомий*/
	UnknownLvl= 0x00
}tk2_pumping_t;

/* Оголошення ескриптор для прогонозування рівня води в резервуарі */
typedef struct {
	uint64_t Time;  /* Тривалість наповнення/опустошення резервуару, поточний */
	uint64_t Cntr;  /* Лічильник циклів */
	uint64_t Sum;   /* Сума тривалостей */
	uint64_t Ave;   /* Тривалість наповнення/опустошення резервуару, середня
	 	 	 	 	   за весь час життєвого циклу */
}lvl_t;

/* Робота з датчиками і процес-баром наповнення резервуару */
typedef struct  {
	lvl_t lh;  /* Структурка для роботи з наповнення резервуару */
	lvl_t hl;  /* Структурка для роботи з опустошенням резервуару */

	tk2_pumping_t Old;   /* Стан датчиків попередній*/
	tk2_pumping_t Event; /* Стан датчиків - подія*/
}brl_t;

/* Ця функція повертає статус функціонування насоса на основі
 * величини відліків АЦП на вході контролера від датчиків
 * НИЖНЬОГО РІВНЯ і ВЕРХНЬОГО РІВНЯ.
 * Параметри:
   pumping_mode: Вид роботи тк2:

          	case 0:Відкачка, датчики рівня              (ОЭ)
          	case 1:Подача, ЕКМ                          (ПЕ)
          	case 2:Подача, датчики рівня                (ПЭ)
          	case 3:Подача, реле тиску/поплавковий датчик(ПП)
          	case 4:Відкачка, поплавковий датчик         (ОП)
          	case 5:Подача, датчик тиску                 (ПО)
   ll_adc - відліки АЦП від датчика нижнього рівня
   hl_adc - відліки АЦП від датчика верхнього рівня        */
tk2_pumping_t  f_get_pumping_status(
		uint16_t pumping_mode,
		uint16_t lh_adc,
		uint16_t hl_adc,
		brl_t *pbrl
		);

uint16_t get_BarrrelPro(void);
/*******************************************************/

#endif /* SRC_MB_WINDOWS_TK2_A5_TK2LEVELS_H_ */
