/*  Получилось собрать все новое в одну отдельную функцию
 *  обработки сообщений Модбас, полученых от Мастера.
 *  Удобно для отладки, ничего больше не трогает.
 *  Но..
 *  1) Я не понимаю, где из вашей программы эту функцию вызвать,
 *  там много разных непонятных мне параметров
 *  2) При записи и чтении мне не всегда понятны переходы от модбасовских регистров
 *  к уже существующим параметрам в ТК-2
 *  ============================================================================================
 *  Получилось даже проверить работу модбас с тремя десятками тестовых входных модбас-сообщений,
 *  ============================================================================================
 *  все работает и правильно дает ответы оли ответы об ошибке.
 *  Я использую не if, а else if, так правильно по науке, и работает быстрее
 *  и проще в логике не запутываться. Все видно, легко прослеживается и меняется, если нужно
 *  все отступы красиво позволяют не вносить ошибки.
 *  Естественно я брал как основу, то что у вас уже было.
 *  ПРЕДЛАГАЮ взять за основу.
 *  Если вы выкинете предыдущие куски, которые это же делает,
 *  вставите отдельно ЭТУ ФУНКЦИЮ и вызов функции,
 *  то мы упростим себе жизнь, отлаживая программу.
 *  Все что я нафантазировал в плане не модбас, а реальных параметров - легко меняется.
 *
 *
 *  */

/*
=====================================================================================
ЛИШЕ ПИСАТИ:
=====================================================================================
0х0000  Заданный режим работы станции           RJ_Mod    			31,32,33
0х0001  Завдання на автоматичну роботу          Task_Station  	    0, 1
0х0002  Пуск/Стоп електродвигуна                Command_Driv        1, 10, 11, 2
0х0003  Скидання захисту електродвигуна         Reset_Protect1
0х0004  Скидання перевищення запусків           Reset_Protect2
0х0005  Введення паролю                         SET_ACCESS_PASSWORD 1234
0х0006  Скидання пароля                         0
0х0007  Резерв

==========================================================================================
ЛИШЕ ЧИТАТИ:
==========================================================================================
0x0100	Режим поточний	                     	TKA_MB;
0х0101  Завдання поточне  					 	TaskMB_RAD;
0х0102  Стан електродвигуна                  	St_Driv
0х0103  Захист (наявність аварії)				KTZ
0х0104  Бітові коди рівнів               		VU_NU_SX
0х0105  Струм фази 1                   			IndArray[0]
0х0106  Струм фази 2                   			IndArray[1]
0х0107  Струм фази 2                   			IndArray[2]
0х0108  Виміряний опір ізоляції					Isol_O
0х0109  Виміряна асиметрія					    Assim_O_Prz
0х010А  Виміряний рівень сухого коду			IndArray[7]
0х010В  Виміряний нижній рівень НУ				IndArray[5]
0х010С	Виміряний верхній рівень                IndArray[6]
0х010D  Версія проекту                          arr[ver_prj];
0х010E  Лічильник обмінів 						TimeCode105
0х010F  Резерв

================================================================================
ПИСАТИ/ЧИТАТИ НАЛАШТУВАННЯ КОРИСТУВАЧА
================================================================================
0х1000  Резерв                                  arr[0]
0х1001  Адреса в мережі Модбус                  arr[1]/ADR1           02
0х1002  Уставка захисту від струмового          arr[2]
        перевантаження
0х1003  Уставка захисту від струмового          arr[3]
        недовантаження
0х1004  Уставка посійної часу нагрівання ЕД     arr[4]                 не тут?
0х1005  Вид роботи Подача/Відкачка              arr[5]
        і вид датчиків
0х1006  Затримка пуску ЕД по рівню              arr[6]                 не тут
0х1007  Затримка зупинки ЕД по рівню            arr[7]                 не тут
0х1008  Тип станції                             arr[8]                 не тут

=================================================================================
ПИСАТИ/ЧИТАТИ НАЛАШТУВАННЯ ЗАВОДСЬКІ
=================================================================================
0х1014  Уставка допустимої кількості 			arr[20]
        пусків ЕД за 4 хв
0х1015  Уставка порогу спрацювання 			    arr[21]
        датчиків рівня
0х1016  Уставка для контролю ізоляції ЕД
        при відсутності плавного пуску
0х1017  Режим роботи                            в розділ 1
0х1018  Самозапуск                              в розділ 1
0х1019  Резерв
0x101A  Вибір контролю -
        опір ізоляції/плавний пуск
0x101B  Затримка включення аварії датчки СХ
0x101C  Уставка для запуску ЕД з плавним пуском
0x101D  Резерв
0x101E	Фазність(для трифазного двигуна)
0x101F  Резерв
0x1020
0x1021

*/

