/*
 * tk2_dist.h
 *
 *  Created on: 10 груд. 2019 р.
 *      Author: KozakVF
 */

#ifndef SRC_MB_DEVS_TK2_DIST_H_
#define SRC_MB_DEVS_TK2_DIST_H_

#include "tk4_dist.h"
int f_tk2_0310Responce(d_type_t *q, uint16_t *in);
/*
В цій інструкції описано порядок організації дистанційного управління станціями ТК112
з використанням мережі Модбас .
Контролер ТК2 станції ТК112 реалізує окремі функції протоколу Модбас, зокрема –
 03 (0x03) Read Holding Registers та 06 (0x06) Write Single Register (див.додаток 1).

1.	Перехід в дистанційний режим роботи та вихід з нього

Дистанційне зчитування параметрів роботи станції може здійснюватися у будь-якому режимі роботи.
Для здійнення дистанційного управління або дистанційних налаштувань необхідно вибрати режим роботи РУЧНИЙ ДИСТАНЦІЙНИЙ або АВТОМАТИЧНИЙ ДИСТАНЦІЙНИЙ за допомогою органів управління контролера ТК2.
Перехід з режиму РУЧНИЙ ДИСТАНЦІЙНИЙ в режим  АВТОМАТИЧНИЙ ДИСТАНЦІЙНИЙі навпаки може здійснюватися за командами Модбас

Регістр		Значення	Результат
=================================
0x1200		0x0003		Ручний дистанційний
			0х0004		Автомат.дистанційний
Будь який інший вміст регісра ігнорується

Перехід з режимів РУЧНИЙ ДИСТАНЦІЙНИЙ або  АВТОМАТИЧНИЙ ДИСТАНЦІЙНИЙ в режими
РУЧНИЙ або АВТОМАТИЧНИЙ здійснюється лише за допомогою органів управління ТК2

2.	Дистанційне оперативне управління
2.1.	В режимі РУЧНИЙ ДИСТАНЦІЙНИЙ пуск та зупинка електродвигуна насоса здійснюється за командами Модбас шляхом запису в :
Регістр		Значення			Результат
=========================================
0x1202		0x0001				Пуск електродвигуна
			0х0002				Зупинка електродвигуна
Будь який інший вміст регісра ігнорується


2.2.	В режимі АВТОМАТИЧНИЙ ДИСТАНЦІЙНИЙ включення та виключення роботи електронасоса за датчиками здійснюється шляхом запису:
Регістр		Значення			Результат
=========================================
0x1201		0x0001				Старт  роботи за датчиками
			0х0002				Зупинка  роботи за датчиками
Будь який інший вміст регісра ігнорується

2.3 Оперативне відслідковування в автоматичному режимі (РУЧНИЙ ДИСТАЦІЙНИЙ або АВТОМАТИЧНИЙ ДИСТАНЦІЙНИЙ) поточних параметрів параметрів роботи здійснюєся шляхом зчитування таких регістрів:

Параметр						Регістр		Значення	Результат
===================================================================
Поточний режим роботи			0x0200		0x0003		Ручний дистанційний
											0х0004		Автомат.дистанційний
Поточний струм фази А			0x0201		0.0..600.0А (значення регістра  /10)
Поточний струм фази B			0x0202
Поточний струм фази C 			0x0203
Асиметрія струму				0x020B
Рівень рідини в резервуарі/
сигнал реле тиску чи сухого ходу0х020F		0x0001		Сигнал сухого ходу
											0х0002
											0х0004
Сигнал верхнього рівня
Сигнал нижнього рівня
2.4 В разі необхідності, після спрацювання захисту, скидання коду захисту
Команда	Регістр писати	Значення	Результат
Скинути код захисту	0x1203	0х0001	Скидання коду захисту
Скинути перевищення граничної кількості скидань захисту 	0х1204	0x0001
	Скидання граничної кількості скидань
захисту

2.3 Оперативне відслідковування в автоматичному режимі (РУЧНИЙ ДИСТАЦІЙНИЙ або АВТОМАТИЧНИЙ ДИСТАНЦІЙНИЙ) додаткових  параметрів роботи, в разі необхідності, здійснюєся шляхом зчитування таких регістрів:
Параметр	Регістр	Значення	Результат
Поточний рівень сигналу датчика сухого ходу	0х0210	100..2500	відліки АЦП
Поточний рівень сигналу датчика верхнього рівня	0х0211
Поточний рівень сигналу датчика нижнього рівня	0х0212
Останнє значення результату вимірювань опору ізоляції	0х020Е
2.4 Підтримується оперативне дистанційне відслідковування параметрів з використанням команди зчитування блоку регістрів (початковий регістр 0х1000, кількість регістрів 0х0010).
У відповіді містяться такі парраметри
Параметр	Порядковий номер регістра у відповіді	Значення	Результат
Поточний режим роботи	0х0
Старт автоматичної роботи за датчиками (вкл-1, викл.0)	0х1
Стан електродвигуна вкл-1, викл-0	0х2
Код аварії	0х3
Рівень рідини в резервуарі/сигнал реле тиску чи сухого ходу 	0х4	0x0001
0х0002
0х0004 	Сигнал сухого ходу
Сигнал верхнього рівня
Сигнал нижнього рівня
Право доступу  	0х5
Поточний струм фази А	0х6	0.0..600.0А            (значення регістра  /10)
Поточний струм фази B	0х7
Поточний струм фази C 	0х8
Останнє значення результату вимірювань опору ізоляції	0х9
Асиметрія струму	0хА	0х0004	Автомат.дистанційний
Поточний рівень сигналу датчика сухого ходу	0хB	100..2500	відліки АЦП
Поточний рівень сигналу датчика нижнього рівня 	0хС
Поточний рівень сигналу датчика верхнього рівня	0хD
Лічильник обмінів	0xE
Версія проекта	0xF

3.	Налаштування користувача
3.1.	Налаштування, які не потребують введення паролю
Налаштування	Регістр читати	Регістр писати	Значення	Результат
Режим роботи системи 	0x0200	0x1017	0x0003	Ручний дистанційний
			0х0004	Автомат.дистанційний
Верхня границя струмового перевантаження 	0x0205	0x1002	0.0..600.0А    (значення регістра  /10)
Нижня границя струмового недовантаження 	0x0206	0x1003

3.2.	Налаштування, які потребують введення паролю
Налаштування	Регістр читати	Значення	Результат
Перевірка прав доступу  	0x021B	0x0000	Запис заборонено
		0х0001	Запис дозволено

Налаштування	Регістр писати	Значення	Результат
Введення паролю доступу до змін параметрів  	0x1205	0x04D2	Надано доступ


Налаштування	Регістр читати	Регістр писати	Значення	Результат
Вид роботи в авт.режимі і вибрані датчики	0x0207	0x1005	0x0000
0х0001
0х0002
0х0003 	Відкачування, електродні/оЭ
Подача ЭКМ/ПЭ
Подача, електродні/Э
Подача Э
Самозапуск в авт.режимі
Не працює	0x020C	0x1018	0x0000
0х0001 	Самозапуск заборонено
Самозапуск дозволено
  ((SBUFrx[3]>=20)&&(SBUFrx[3]<23))))
Адреса Модбас 	0218	0х1001	0х0001..0х00F7 Ok
          if(N_ADR_Reg==0x020C)
           {SBUFtx[3]=0;SBUFtx[4]=arr[24];} //Самозапуск, arr[24]
Налаштування	Регістр писати	Значення	Результат
Припинення прав доступу   	0x0205	не 0x04D2	Скинуто права доступу
Зміна паролю 	0x101D	0x**** будь який новий пароль користувача

4.	Налаштування виробника, потребують введення паролю
Налаштування	Регістр читати	Регістр писати	Значення	Результат

Типорозмір станції	0x0208	0х1008		Ok
Постійна часу нагрівання 	0х0209	0х1004	90	Ok
Фазність	0х020А	0x101E		Ok
Контроль ізоляції 	0x020D	0х1015		Ок
Граничне значення для контролю ізоляції 	0х0213	0х1016
Затримка пуску ЕД по рівню	0х0214	0х1006		Ok
Затримка зупинки ЕД по рівню	0х0215	0х1007		Ok
Гранична кількість пусків ЕД протягом 10хв	0x0216	0x1014		Оk
Затримка відновлення роботи датчика «сухого ходу» після аварії «сухого ходу»	0х0217	0х1012		Ok
Вибір контр опору ізоляції/Пл.Пуск arr[26]	0x0219	0x101A		Ок


2.4 Підтримується оперативне дистанційне відслідковування параметрів з використанням команди зчитування блоку регістрів (початковий регістр 0х1000, кількість регістрів 0х0010).
У відповіді містяться такі парраметри
Параметр														Порядковий номер регістра у відповіді	Значення	Результат
Поточний режим роботи											0х0
Старт автоматичної роботи за датчиками (вкл-1, викл.0)			0х1
Стан електродвигуна вкл-1, викл-0								0х2
Код аварії														0х3
Рівень рідини в резервуарі/сигнал реле тиску чи сухого ходу 	0х4	0x0001  Сигнал сухого ходу
Сигнал верхнього рівня												0х0002
Сигнал нижнього рівня												0х0004 	Сигнал сухого ходу


Право доступу  													0х5
Поточний струм фази А											0х6	0.0..600.0А            (значення регістра  /10)
Поточний струм фази B											0х7
Поточний струм фази C 											0х8
Останнє значення результату вимірювань опору ізоляції			0х9
Асиметрія струму												0хА	0х0004	Автомат.дистанційний
Поточний рівень сигналу датчика сухого ходу						0хB	100..2500	відліки АЦП
Поточний рівень сигналу датчика нижнього рівня 					0хС
Поточний рівень сигналу датчика верхнього рівня					0хD
Лічильник обмінів												0xE
Версія проекта													0xF

*/
typedef struct {
//Постійна часу нагрівання
uint16_t fsHeatingTimeConstant                      ;
//Гранична кількість пусків ЕД протягом 10хв
uint16_t fsNumberStartLimit							;

//Затримка пуску ЕД по рівню
uint16_t fsOnSensorMotorDelay					    ;
//Затримка зупинки ЕД по рівню
uint16_t fsOffSensorMotorDelay						;
//Затримка відновлення роботи датчика «сухого ходу» після аварії «сухого ходу»	0х0217	0х1012
uint16_t fsAftrerDryMoveDelay						;

//Вибір контр опору ізоляції/Пл.Пуск a
uint16_t fsInsul_SoftStart_Option					;
//Контроль ізоляції 					;
//Уставка для контроля Изоляции двигателя  при отсутствии плавного пуска
uint16_t fsInsul_WithoutSoftStart					;


//Уставка порога срабатывания датчика уровня
uint16_t fsLevelSensorLimit							;
//Уставка для запуска двигателя
uint16_t fsSoftStart_prm							;
//Типорозмір станції
uint16_t fsTyporozmir								;
//Фазність
uint16_t fsPhasnost	                                ;

} tk2_fs_t;




#endif /* SRC_MB_DEVS_TK2_DIST_H_ */
