/*
 * tk2_dist.c
 *
 *  Created on: 10 груд. 2019 р.
 *      Author: KozakVF
 */


#include "tk2_dist.h"

d_type_t tk2d={0};

//2.4 Підтримується оперативне дистанційне відслідковування параметрів з використанням команди зчитування блоку регістрів (початковий регістр 0х1000, кількість регістрів 0х0010).
int f_tk2_0310Responce(d_type_t *q, uint16_t *in){
//У відповіді містяться такі парраметри
//Параметр														Порядковий номер регістра у відповіді	Значення	Результат
//Поточний режим роботи											0х0
q->d_regime=			( control_type_t)in[0x0];
//Старт автоматичної роботи за датчиками (вкл-1, викл.0)		0х1
q->d_AutoCtrl  =               (on_off_t)in[0x1];
//Стан електродвигуна вкл-1, викл-0								0х2
q->d_MotorState=         	   (on_off_t)in[0x2];
//Код аварії
q->d_motorfault=    	   (motorfault_t)in[0x3];
//Рівень рідини в резервуарі/сигнал реле тиску чи сухого ходу 	0х4	0x0001  Сигнал сухого ходу
//Сигнал верхнього рівня											0х0002
//Сигнал нижнього рівня												0х0004 	Сигнал сухого ходу
q->d_CX=   						(on_off_t)(in[0x4]/4);
q->d_NU=                       (on_off_t)((in[0x4] % 4)/2);
q->d_VU=     				    (on_off_t)(in[0x4] % 2);
//Право доступу  												0х5
// &&&&&&&&&&&&&&&
//Поточний струм фази А											0х6	0.0..600.0А            (значення регістра  /10)
q->d_aAmperage   =                 (float)(in[0x6])/10.0f;
//Поточний струм фази B											0х7
q->d_bAmperage   =                 (float)(in[0x7])/10.0f;
//Поточний струм фази C 										0х8
q->d_cAmperage   =                 (float)(in[0x8])/10.0f;
//Останнє значення результату вимірювань опору ізоляції			0х9
q->d_InsulationResistance= 		   (float)(in[0x9]);
//Асиметрія струму												0хА	0х0004	Автомат.дистанційний
q->d_AmperageUnbalance=						in[0xA];
//Поточний рівень сигналу датчика сухого ходу					0хB	100..2500	відліки АЦП
q->d_DryModeADC=                            in[0xB];
//Поточний рівень сигналу датчика нижнього рівня 				0хС
q->d_LowLevelADC=                            in[0xC];
//Поточний рівень сигналу датчика верхнього рівня				0хD
q->d_LowLevelADC=                            in[0xD];
//Лічильник обмінів												0xE
// &&&&&&&&&&&&&&&&&&&&&&&&&&&
//Версія проекта												0xF
// &&&&&&&&&&&&&&&&&&&&&&&&&&&
return 0;
}

